Tekla Open API Reference for Tekla Structures 2025
ProfileItem.ModifyProfileItemParameter Method
 Modify parameter of library profile item. Modify is needed for profile item for updating changes to profile database
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ModifyProfileItemParameter(
	ProfileItemParameter value
)
Public Function ModifyProfileItemParameter (
	value As ProfileItemParameter
) As Boolean
Parameters
value
Type: Tekla.Structures.Catalogs.ProfileItemParameter
The modified parameter value for the profile item.
Return Value
Type: Boolean
True on success.
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace